Repository: qcubed-4/application
Catalog: install/project/i18n/*.po
Languages: es

source: Switch to
es: Cambiar a

source: Internationalization and Translation
es: Internacionalización y Traducción

source: QCubed offers internationalization support via its I18n library
es: QCubed ofrece soporte de internacionalización mediante su librería I18n

source: See the I18N library ReadMe for details on how to set it up, but it basically involves creating a translator, pointing the translator to the translation files, and setting the language settings.
es: Consulta el archivo ReadMe de la librería I18N para conocer los detalles sobre cómo configurarla, pero básicamente implica crear un traductor, dirigir el traductor a los archivos de traducción, y establecer la configuración del idioma.

source: The translation library has a few different modes of operation, but one popular translation file format it can read is the GNU .PO file format found at <a href="http://www.gnu.org/software/gettext/manual/html_node/gettext_9.html"> http://www.gnu.org/software/gettext/manual/html_node/gettext_9.html</a>
es: La librería de traducción tiene varios modos de operación, pero uno de los formatos de archivo de traducción más populares que puede leer es el formato GNU .PO encontrado en <a href="http://www.gnu.org/software/gettext/manual/html_node/gettext_9.html"> http://www.gnu.org/software/gettext/manual/html_node/gettext_9.html</a>

source: To translate any piece of text, simply use <b>t(xxx)</b>. Or as a shortcut, if you want to do a PHP <b>print()</b> of any translated text in your template, you can use the QCubed printing shortcut <b>_t(xxx)</b> -- this does the equivalent of <b>print(t(xxx))</b>.
es: Para traducir cualquier fragmento de texto, simplemente utiliza <b>t(xxx)</b>. O como un atajo, si deseas hacer un <b>print()</b> en PHP de cualquier texto traducido en tu plantilla, puedes usar el atajo de impresión de QCubed <b>_t(xxx)</b> — esto hace lo equivalente a <b>print(t(xxx))</b>.

source: Note that generated Forms and the Controls are all I18n aware -- they will translate themselves based on the selected language (as long as the appropriate language file exists). QCubed-specific language files are part of QCubed core and exist in the i18n directories of their respective libraries. If you are able to contribute, please and take the current en.po file and translate it to any currently unsupported language and feel free to submit it.
es: Ten en cuenta que los Formularios generados y los Controles tienen soporte I18n — se traducirán según el idioma seleccionado (siempre que exista el archivo de idioma correspondiente). Los archivos de idioma específicos de QCubed forman parte del núcleo de QCubed y se encuentran en los directorios i18n de sus respectivas bibliotecas. Si puedes contribuir, por favor toma el archivo en.po actual y tradúcelo a cualquier idioma actualmente no soportado y siéntete libre de enviarlo.

source: Internationalization Example
es: Ejemplo de Internacionalización

source: Current Language
es: Idioma actual

source: none
es: ninguno
